{
    "title": "Creamy spiced black bean quesadilla",
    "time": "20 minutes",
    "servings": 4,
    "kind": "Dinner",
    "source": "Happy Pear",
    "url": "https://thehappypear.ie/recipes/creamy-spiced-black-bean-quesadilla/",
    "ingredients": [
        {"name": "whole wheat tortillas", "quantity": 4, "unit": ""},
        {"name": "black beans", "quantity": 1, "unit": "can"},
        {"name": "scallions", "quantity": 2, "unit": ""},
        {"name": "red onion", "quantity": 0.5, "unit": ""},
        {"name": "cherry tomatoes", "quantity": 10, "unit": ""},
        {"name": "chilli pepper", "quantity": 1, "unit": ""},
        {"name": "avocado", "quantity": 1, "unit": ""},
        {"name": "cumin seed", "quantity": 1, "unit": "tsp"},
        {"name": "cumin", "quantity": 1, "unit": "tsp"},
        {"name": "coriander", "quantity": 1, "unit": "tsp"},
        {"name": "smoked paprika", "quantity": 0.25, "unit": "tsp"},
        {"name": "cinnamon", "quantity": 0.25, "unit": "tsp"},
        {"name": "black pepper", "quantity": 0.25, "unit": "tsp"},
        {"name": "garlic powder", "quantity": 0.5, "unit": "tsp"},
        {"name": "tamari", "quantity": 1, "unit": "tbsp"},
        {"name": "lime", "quantity": 0.5, "unit": ""},
        {"name": "lemon", "quantity": 0.5, "unit": ""},
        {"name": "cashew", "quantity": 8, "unit": "oz"},
        {"name": "alternative milk", "quantity": 5, "unit": "oz"}
    ],
    "process": [
        "In a bowl add the cashew nuts and pour over boiled water and leave to soak for 5 mins.",
        "Peel and slice the red onion in thin strips. Slice the spring onions at an angle thinly.",
        "Drain and rinse the black beans. Quarter the cherry tomatoes and finely chop the coriander and red chilli (remove the seeds if you like it less spicy). Peel and slice the avocado into thin slices.",
        "Heat a non stick pan on high heat, once hot add the sliced onions, spring onion and chilli and fry for 2 mins stirring continuously. Add the spices, tamari, lime juice, salt and fry for 30 seconds. Next add the drained beans and quartered cherry tomatoes and cook for 2 mins mashing and stirring.",
        "Drain and rinse the cashew nuts and add to a blender along with the rest of the ingredients for the cashew cheese and blend till nice and super smooth.",
        "Clean the pan and dry it, once hot add a tortilla and leave to heat up for 10 seconds. Spoon on a generous serving of the cashew cheese across the full tortilla, put a good dollop of the fried black bean salsa on ½ the tortilla, top with sliced avocado some diced coriander, and a sprinkle of chilli. Fold over the tortilla, and once starting to brown and crisp up around the corners remove from the pan and slice on a chopping board. Repeat with the remaining tortillas and fillings. Keep any remaining cashew cheese to use for other sandwiches it will last 5 days in the fridge. Enjoy!"
    ]
}